import { Injectable } from '@angular/core';

@Injectable()
export class AboutService {

 ArAbout = {
     Who:`كيرمينا لمنتجات الكاوتشوك و البلاستيك هي شركة رائدة في مجال صناعة الكاوتشوك لدينا خبرة تزيد عن الثلاثون عاماً داخل السوق المصري والعربي.
     نقوم بإنتاج جميع أنواع المطاط الطبيعي والصناعي المضاد  للأحماض والمواد البترولية والقلويات وخامة السليكون المضادة لدرجات الحرارة العالية و الأحماض وخامة البولي يوريثان المضادة  للضغوط و الاحتكاك و منتجات اخرى كثيرة. نعدكم بأفضل مستوى من الجودة العالية و إلتزامنا بأحدث وأدق المعاييرو المواصفات العالمية فى جميع خدامتنا. و حرصنا على خدمة ما بعد البيع أو أى إستشارات فنية .   
     `,
     what:`نقدم فى كيرمينا منتجات متعددة تتميز بكفاءة عالية و جودة متميزة وفقاً للمعايير و المواصفات الدولية مثل:`,
     whatList:[
         "كسوة السلندرات و الدرافيل",
         "المكبوسات ",
         "المسحوبات",
         "التبطين بالكاوتشوك",
         "تصنيع الدرافيل المعدنية ",
         "السيلكون",
         "البولي يوريثان"
     ]
    };

    constructor() { }

    getaboutData(){
        return this.ArAbout;
    }
}